# CategoryId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctPressureDropData..::..CategoryId Property
DuctPressureDropData Class See Also
---
The category id of duct curves. It will be OST_DuctCurves, OST_FlexDuctCurves, or OST_PlaceHolderDucts.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ElementId CategoryId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CategoryId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ CategoryId {
	ElementId^ get ();
}
```

# See Also
DuctPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace